In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import glob
import numpy as np
pd.options.display.max_rows = 250


import plotly.express as px
import seaborn as sns

In [2]:
from sqlalchemy import create_engine

db_name = 'mm_db'
db_password = 'database123!'
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/{db_name}"
engine = create_engine(db_string)

In [3]:
teams = pd.read_sql("select teamid, teamname from teams", engine)
teams

# #1) Use ../mens-march-mania-2022/MDataFiles_Stage2/MTeams.csv to creat team df
# teams = pd.read_csv(files[15],usecols=['TeamID','TeamName'])
# #teams

# # 2) NCAA Basketball Season Data (../mens-march-mania-2022/MDataFiles_Stage2/MSeasons.csv)
# seasons = pd.read_csv(files[2])

# # Conferences
# conferences = pd.read_csv(files[11],usecols=['TeamID', 'ConfAbbrev'])

# # 3) Seeds in tournament
# seeds = pd.read_csv(files[16])
# #seeds.tail()

# # 4) Merge Teams and Tourney Seed DF's
# seeds = pd.merge(seeds, teams,on='TeamID')
# seeds

     teamid      teamname
0      1101   Abilene Chr
1      1102     Air Force
2      1103         Akron
3      1104       Alabama
4      1105   Alabama A&M
..      ...           ...
367    1468    Bellarmine
368    1469      Dixie St
369    1470   Tarleton St
370    1471  UC San Diego
371    1472  St Thomas MN

[372 rows x 2 columns]

In [14]:
seasons = pd.read_sql("select * from mseasons", engine)
seasons

    season day_zero region_w region_x region_y region_z
0     1985        1        E        W        M        S
1     1986        1        E        M        S        W
2     1987        1        E        S        M        W
3     1988        1        E        M        S        W
4     1989        1        E        W        M        S
5     1990        1        E        M        S        W
6     1991        1        E        S        M        W
7     1992        1        E        W        M        S
8     1993        1        E        M        S        W
9     1994        1        E        S        M        W
10    1995        1        E        W        M        S
11    1996        1        E        M        S        W
12    1997        1        E        S        M        W
13    1998        1        E        W        M        S
14    1999        1        E        M        S        W
15    2000        1        E        S        M        W
16    2001        2        E        W        M        S
17    2002        2        E        M        S        W
18    2003        2        E        S        M        W
19    2004        2        A        P        E        S
20    2005        2        A        C        A        S
21    2006        2        A        O        M        W
22    2007        2        E        S        M        W
23    2008        2        E        M        S        W
24    2009        2        E        S        M        W
25    2010        2        E        S        M        W
26    2011        2        E        W        S        S
27    2012        2        E        M        S        W
28    2013        2        E        S        M        W
29    2014        2        E        S        M        W
30    2015        2        E        S        M        W
31    2016        2        E        M        S        W
32    2017        2        E        W        M        S
33    2018        2        E        M        S        W
34    2019        2        E        W        M        S
35    2020        2        N        N        N        N
36    2021        2        E        W        M        S
37    2022        2        E        W        M        S

In [16]:
conferences = pd.read_sql("select team_id, conf_abbrev from mteam_conferences", engine)
conferences

       team_id conf_abbrev
0         1102           w
1         1103           o
2         1104           s
3         1106           s
4         1108           s
...        ...         ...
12294     1468           a
12295     1469           w
12296     1470           w
12297     1471           b
12298     1472           s

[12299 rows x 2 columns]

In [17]:
seeds_detailed = pd.read_sql("select * from seeds_detailed", engine)
seeds_detailed

      teamid        teamname  season  seed
0       1207      Georgetown    1985   W01
1       1210    Georgia Tech    1985   W02
2       1228        Illinois    1985   W03
3       1260  Loyola-Chicago    1985   W04
4       1374             SMU    1985   W05
...      ...             ...     ...   ...
2417    1151     Chattanooga    2022   Z13
2418    1255        Longwood    2022   Z14
2419    1174        Delaware    2022   Z15
2420    1136          Bryant    2022  Z16a
2421    1460       Wright St    2022  Z16b

[2422 rows x 4 columns]

In [19]:
# 5) Separating regions and Seeds (Ex: making Seed Z16 go to 16)

seeds_detailed['region'] = seeds_detailed['seed'].apply(lambda x: x[0][:1])
seeds_detailed['seed'] = seeds_detailed['seed'].apply(lambda x: int(x[1:3]))

print(seeds_detailed.head())
print(seeds_detailed.shape)

   teamid        teamname  season  seed region
0    1207      Georgetown    1985     1      W
1    1210    Georgia Tech    1985     2      W
2    1228        Illinois    1985     3      W
3    1260  Loyola-Chicago    1985     4      W
4    1374             SMU    1985     5      W
(2422, 5)

In [20]:
seeds_detailed

      teamid        teamname  season  seed region
0       1207      Georgetown    1985     1      W
1       1210    Georgia Tech    1985     2      W
2       1228        Illinois    1985     3      W
3       1260  Loyola-Chicago    1985     4      W
4       1374             SMU    1985     5      W
...      ...             ...     ...   ...    ...
2417    1151     Chattanooga    2022    13      Z
2418    1255        Longwood    2022    14      Z
2419    1174        Delaware    2022    15      Z
2420    1136          Bryant    2022    16      Z
2421    1460       Wright St    2022    16      Z

[2422 rows x 5 columns]

In [21]:
season_results = pd.read_sql("select * from mregular_season_detailed_results", engine)

In [25]:
winning_cols = ['season', 'wteam_id', 'wloc', 'wfgm', 'wfga', 'wfgm3', 'wfga3', 'wftm', 'wfta', 'wor', 'wdr', 'wast', 'wto', 'wstl', 'wblk', 'wpf']
losing_cols = ['season', 'lteam_id', 'lfgm', 'lfga', 'lfgm3', 'lfga3', 'lftm', 'lfta', 'lor', 'ldr', 'last', 'lto', 'lstl', 'lblk', 'lpf']
columns = ['season', 'team_id', 'fgm', 'fga', 'fgm3', 'fga3', 'ftm', 'fta', 'or', 'dr', 'ast', 'to', 'stl', 'blk', 'pf']

winning_stats = season_results[winning_cols].groupby(['season', 'wteam_id']).mean().reset_index()
winning_stats.columns = columns

losing_stats = season_results[losing_cols].groupby(['season', 'lteam_id']).mean().reset_index()
losing_stats.columns = columns

reg_season_stats = pd.concat([winning_stats, losing_stats]).groupby(['season', 'team_id']).mean().reset_index()
reg_season_stats['id'] = reg_season_stats.season.astype(str) + reg_season_stats.team_id.astype(str)


reg_season_stats.tail()

,season,team_id,fgm,fga,fgm3,fga3,ftm,fta,or,dr,ast,to,stl,blk,pf,id
6887,2022,1468,25.206731,55.151442,7.790865,23.158654,9.057692,12.074519,6.161058,20.115385,13.110577,8.954327,5.086538,1.375000,15.218750,20221468
6888,2022,1469,24.861111,59.083333,6.888889,22.055556,13.833333,20.555556,8.583333,24.805556,15.083333,14.305556,5.944444,2.472222,19.527778,20221469
6889,2022,1470,22.596257,53.411765,5.435829,16.874332,13.820856,18.414439,7.526738,18.625668,11.024064,9.949198,7.254011,2.136364,17.812834,20221470
6890,2022,1471,23.647727,52.948864,8.982955,24.215909,13.767045,18.224432,4.653409,22.588068,13.468750,12.360795,5.326705,1.857955,15.039773,20221471
6891,2022,1472,27.082143,58.857143,11.007143,29.842857,11.782143,14.746429,5.742857,20.142857,12.532143,7.432143,4.896429,1.235714,16.928571,20221472